[
  {
    "party_name": "DMK",
    "case_details": "Transport Department Cash-for-Jobs Scam: Alleged racket in state transport corporations (MTC, TNSTC) where bribes were collected for driver, conductor and junior engineer posts; ED registered a money-laundering case based on these predicate offences and arrested the accused minister in June 2023.[web:16][web:22]",
    "who_did_it": "V. Senthil Balaji.[web:16]",
    "time": "Alleged scam period 2011–2015; arrested by ED in June 2023; granted bail by the Supreme Court after about 471 days in custody, in September 2024.[web:16][web:22][web:19]",
    "affiliation": "Senior DMK leader and state minister at the time of ED arrest (earlier Transport Minister in an AIADMK government during the alleged bribery period).[web:16][web:19]",
    "source": "[web:16][web:19][web:22]"
  },
  {
    "party_name": "DMK",
    "case_details": "Disproportionate Assets Cases Against Durai Murugan: Two DVAC cases alleging that the minister and his wife acquired assets worth about ₹1.4 crore disproportionate to known sources of income between 2007 and 2009, when he was PWD minister in the 2006–2011 DMK government; earlier discharge orders were set aside and a fresh trial ordered.[web:55][web:19]",
    "who_did_it": "Durai Murugan and his wife (DVAC named them as accused in the DA cases).[web:55]",
    "time": "Alleged accumulation period 2007–2009; Madras High Court ordered framing of charges and day-to-day trial in April 2025.[web:55][web:19]",
    "affiliation": "DMK general secretary and Tamil Nadu Water Resources Minister in the present government.[web:19][web:55]",
    "source": "[web:19][web:55]"
  },
  {
    "party_name": "DMK",
    "case_details": "Disproportionate Assets Case Against K. Ponmudy: DVAC case alleging that the minister and his wife amassed wealth disproportionate to known income; Madras High Court convicted him in 2023 under the Prevention of Corruption Act, leading to loss of his ministerial post, before the Supreme Court stayed the conviction and he was briefly re-inducted.[web:19][web:50]",
    "who_did_it": "K. Ponmudy and his wife (named as accused in the DA case).[web:19][web:50]",
    "time": "Offence period relates to an earlier DMK government; conviction by Madras High Court in 2023; Supreme Court stay and political churn in 2023–2025.[web:19][web:50]",
    "affiliation": "Senior DMK leader, former Higher Education/Forest Minister in the current Stalin-led DMK government.[web:19][web:50]",
    "source": "[web:19][web:48][web:50]"
  },
  {
    "party_name": "DMK",
    "case_details": "Hate-Speech Proceedings Against K. Ponmudy: Madras High Court initiated suo motu criminal proceedings over allegedly provocative remarks about certain Hindu sects, clubbing them with other cases where ministers’ conduct was questioned; the court’s observations contributed to political pressure that led to his resignation.[web:19][web:48]",
    "who_did_it": "K. Ponmudy.[web:19][web:48]",
    "time": "Speech and subsequent proceedings came under the High Court’s scanner around 2024–2025, with orders reported in April 2025.[web:19][web:48]",
    "affiliation": "DMK minister and senior party functionary at the time of the remarks.[web:19][web:48]",
    "source": "[web:19][web:48]"
  },
  {
    "party_name": "DMK",
    "case_details": "TASMAC/Distillery Money-Laundering Probe: ED investigation into alleged laundering of unaccounted money through Tamil Nadu distilleries and the state-run liquor retailer TASMAC; the agency claims links between liquor companies and political figures during the DMK regime and has been allowed by courts to proceed under PMLA.[web:19][web:48]",
    "who_did_it": "Owners and executives of certain distilleries and intermediaries; ED has alleged political links but specific DMK leaders’ criminal liability is still under investigation.[web:19][web:48]",
    "time": "Transactions relate to the current DMK rule (from 2021 onwards), with ED searches and court proceedings reported mainly in 2023–2025.[web:19][web:48]",
    "affiliation": "Alleged nexus involves business entities dealing with TASMAC under the DMK-led Tamil Nadu government; individual party leaders’ roles are still being probed.[web:19][web:48]",
    "source": "[web:19][web:48]"
  },
  {
    "party_name": "DMK",
    "case_details": "AIADMK ‘₹4 Lakh Crore Corruption’ Dossier: Opposition leader Edappadi K. Palaniswami submitted a memorandum to the Governor alleging that scams and irregularities worth about ₹4 lakh crore occurred across departments in roughly 4.5 years of DMK rule and demanding a judicial commission; as of now these remain political allegations, not judicially established offences.[web:4][web:46][web:51][web:53]",
    "who_did_it": "Allegations broadly target Chief Minister M. K. Stalin, his cabinet colleagues and senior DMK functionaries; no individual has been convicted on the basis of this dossier yet.[web:4][web:46][web:51]",
    "time": "AIADMK claims cover the DMK government period from May 2021 to late 2025; the memorandum was submitted to the Governor in early January 2026.[web:46][web:51][web:53]",
    "affiliation": "Accusations are against the ruling DMK government in Tamil Nadu; the dossier itself was filed by AIADMK leaders as the principal opposition.[web:4][web:46][web:51]",
    "source": "[web:4][web:46][web:51][web:53]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Disproportionate Assets Case: DVAC registered FIR alleging acquisition of assets worth Rs 28.78 crore during tenure as Commercial Taxes Minister from 2016-2021, amounting to 654% excess over known income sources; raids conducted on 28 premises linked to the accused.[web:88]",
    "who_did_it": "K.C. Veeramani.[web:88]",
    "time": "Asset accumulation 2016-2021; DVAC FIR and raids reported September 2021.[web:88]",
    "affiliation": "Senior AIADMK leader and former Commercial Taxes Minister in AIADMK government.[web:88]",
    "source": "[web:88]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Disproportionate Assets Case: Directorate of Vigilance and Anti-Corruption filed charge sheet alleging amassing of Rs 58.44 crore in assets disproportionate to known sources of income during 2015-2021 period when AIADMK headed the state government; this marks the third such case against former AIADMK ministers since May 2021.[web:90]",
    "who_did_it": "R. Kamaraj.[web:90]",
    "time": "Asset accumulation 2015-2021; charge sheet filed July 2023.[web:90]",
    "affiliation": "Former AIADMK Minister for Food and Civil Supplies and current legislator.[web:90]",
    "source": "[web:90]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Disproportionate Assets Case: DVAC filed chargesheet against former minister and his wife alleging accumulation of disproportionate assets during his tenure; part of series of corruption cases against AIADMK ministers post-2021 regime change.[web:93]",
    "who_did_it": "C. Vijayabaskar and wife.[web:93]",
    "time": "Offence period during AIADMK government; chargesheet filed May 2023.[web:93]",
    "affiliation": "Former AIADMK Minister.[web:93]",
    "source": "[web:93]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Aavin Cash-for-Jobs Scam: CBI booked the former minister and two party workers for allegedly collecting Rs 30 lakh from a shopkeeper and around Rs 3 crore from others promising jobs in state milk cooperative Aavin without delivering them; charged under IPC sections for criminal breach of trust and cheating after Madras High Court transferred probe to CBI.[web:2]",
    "who_did_it": "Rajenthra Bhalaji, K. Vijaya Nallathambi, Mariyappan.[web:2]",
    "time": "Offences during AIADMK regime; CBI FIR and booking reported February 2025.[web:2]",
    "affiliation": "Rajenthra Bhalaji - former AIADMK Minister; others identified as AIADMK functionaries.[web:2]",
    "source": "[web:2]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Civic Contracts Corruption Case: DVAC investigation into Rs 98.25 crore irregularities in awarding contracts for Chennai and Coimbatore corporations during 2014-2018; earlier FIR quashed but re-included as accused after fresh evidence, with Assembly Speaker sanctioning prosecution.[web:5]",
    "who_did_it": "S.P. Velumani.[web:5]",
    "time": "Irregularities 2014-2018; DVAC re-added accused September 2025, arrest sanction 2024.[web:5]",
    "affiliation": "AIADMK MLA and former Municipal Administration Minister.[web:5]",
    "source": "[web:5]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Disproportionate Assets Case Revival: 2006 DA case alleging accumulation of wealth 374 times disproportionate to known income during brief chief ministership and Revenue Minister tenure; Madras High Court reversed 2012 closure and ordered revival and transfer to special court.[web:11]",
    "who_did_it": "O. Panneerselvam.[web:11]",
    "time": "Original case 2006; closure reversed October 2024.[web:11]",
    "affiliation": "Former AIADMK Chief Minister (now expelled functionary).[web:11]",
    "source": "[web:11]"
  },
  {
    "party_name": "NTK",
    "case_details": "Hate Speech Against Migrant Workers: Police registered case under IPC sections for hate speech and SC/ST (Prevention of Atrocities) Act after Seeman allegedly incited violence against Hindi-speaking migrant workers during public speeches.[web:3][web:12]",
    "who_did_it": "S. Seeman.[web:3]",
    "time": "March 2023 during Erode by-election campaign.[web:3][web:6]",
    "affiliation": "NTK Chief and candidate.[web:3]",
    "source": "[web:3][web:12]"
  },
  {
    "party_name": "NTK",
    "case_details": "Hate Speech Against Arunthathiyar Community: FIR registered at Karungalpalayam police station for remarks allegedly targeting the Arunthathiyar (Scheduled Caste) community during political rally.[web:3]",
    "who_did_it": "S. Seeman.[web:3]",
    "time": "2023 Erode East by-election period.[web:3][web:6]",
    "affiliation": "NTK party chief.[web:3]",
    "source": "[web:3][web:6]"
  },
  {
    "party_name": "NTK",
    "case_details": "Defamation Case Against Rajiv Gandhi Remarks: Congress functionary filed complaint alleging slanderous statements describing former PM Rajiv Gandhi as 'betrayer of Tamils' during Vikravandi bypoll campaign speech.[web:9]",
    "who_did_it": "S. Seeman.[web:9]",
    "time": "2019 Vikravandi by-election; Madras HC rejected discharge plea February 2025.[web:9]",
    "affiliation": "NTK leader.[web:9]",
    "source": "[web:9]"
  },
  {
    "party_name": "NTK",
    "case_details": "Hate Speech Against Hindi Imposition: Booked for provocative statements against Hindi-speaking community and alleged threats during public meetings.[web:12]",
    "who_did_it": "S. Seeman.[web:12]",
    "time": "October 2023.[web:12]",
    "affiliation": "NTK Coordinator.[web:12]",
    "source": "[web:12]"
  },
  {
    "party_name": "NTK",
    "case_details": "Erode Court Appearance in Hate Speech Case: Seeman appeared before Erode court pursuant to multiple FIRs related to hate speech during by-election campaign; cases consolidated for hearing.[web:6]",
    "who_did_it": "S. Seeman.[web:6]",
    "time": "September 2023 court appearance for 2023 hate speech cases.[web:6]",
    "affiliation": "NTK chief.[web:6]",
    "source": "[web:6]"
  },
  {
    "party_name": "NTK",
    "case_details": "Madras HC Dismisses Plea to Avoid Court Appearance: High Court rejected Seeman's petition seeking exemption from personal appearance and discharge in 2019 hate speech/defamation case, criticizing repeated provocative speeches.[web:9]",
    "who_did_it": "S. Seeman.[web:9]",
    "time": "February 2025 Madras High Court order.[web:9]",
    "affiliation": "NTK leader.[web:9]",
    "source": "[web:9]"
  },
  {
    "party_name": "NTK",
    "case_details": "Defamation Complaint Quashed: IPS officer's defamation case against Seeman over alleged caste-based remarks quashed by Madras High Court, which warned against using criminal process for reputation laundering against political critics.[web:15]",
    "who_did_it": "S. Seeman (case quashed in his favor).[web:15]",
    "time": "November 2025 Madras High Court quashed cognizance.[web:15]",
    "affiliation": "NTK chief.[web:15]",
    "source": "[web:15]"
  },
  {
    "party_name": "BJP",
    "case_details": "Electoral Bonds Scheme Controversy: Supreme Court struck down the scheme as unconstitutional in 2024; data analysis revealed BJP as largest beneficiary with patterns suggesting quid-pro-quo arrangements where companies under investigation donated large sums post-agency actions.[web:21][web:18][web:24]",
    "who_did_it": "BJP as primary beneficiary (over 50% of total bonds); no individual convictions yet.[web:21][web:27]",
    "time": "Scheme operated 2018-2024; Supreme Court judgment and data release February-April 2024.[web:21][web:27]",
    "affiliation": "Ruling party at Centre; scheme introduced by BJP Finance Ministry.[web:21]",
    "source": "[web:21][web:18][web:24][web:27]"
  },
  {
    "party_name": "BJP",
    "case_details": "Vyapam Scam Political Links: Special Task Force FIR alleges direct/indirect involvement of senior BJP leaders in Madhya Pradesh exam rigging scandal; documents link arrested mining baron Sudhir Sharma's funding to BJP/RSS leaders' travel/expenses during scam period.[web:33][web:36]",
    "who_did_it": "Unnamed senior BJP leaders; Sudhir Sharma (businessman with alleged BJP financial links).[web:33][web:36]",
    "time": "Scam exposed 2013-2015; fresh FIR mentioning political links filed 2022-2023.[web:33][web:39]",
    "affiliation": "BJP governments ruled Madhya Pradesh during scam period and investigation.[web:33][web:36]",
    "source": "[web:33][web:36][web:39]"
  },
  {
    "party_name": "BJP",
    "case_details": "23 Opposition Leaders' Cases Stalled Post-BJP Switch: Investigative agencies halted/delayed proceedings against 23 politicians facing corruption probes after they defected to BJP since 2014; includes cases against now-BJP leaders like Himanta Biswa Sarma, Ashok Chavan.[web:106][web:110]",
    "who_did_it": "Multiple defectors now in BJP; agencies accused of selective inaction post-party switch.[web:106]",
    "time": "Pattern observed 2014-2024 across multiple states.[web:106][web:110]",
    "affiliation": "BJP as beneficiary party receiving defectors facing stalled corruption cases.[web:106]",
    "source": "[web:106][web:110]"
  },
  {
    "party_name": "BJP",
    "case_details": "Tamil Nadu BJP Leader Defamation Cases: DMK government filed defamation cases against state BJP chief K. Annamalai over 'DMK Files' corruption allegations claiming 27 DMK leaders hold ₹2 lakh crore assets; cases stem from political accusations rather than direct scams.[web:32][web:35]",
    "who_did_it": "K. Annamalai (BJP Tamil Nadu president).[web:32]",
    "time": "2023 DMK Files releases; defamation suits filed May 2023 onwards.[web:32][web:35]",
    "affiliation": "BJP Tamil Nadu State President.[web:32]",
    "source": "[web:32][web:35][web:38]"
  },
  {
    "party_name": "TVK",
    "case_details": "Karur Rally Stampede Case: Massive crowd gathering for TVK rally led to stampede killing 41 people; Madras High Court criticized TVK leaders for causing chaos, ordered Special Investigation Team (SIT) probe headed by senior IPS officer; directed police to register hit-and-run case against Vijay's campaign bus for allegedly striking bikes of cadres without stopping.[web:31][web:34][web:37][web:40]",
    "who_did_it": "TVK rally organizers; Vijay personally criticized; campaign bus driver; district secretary N. Sathish Kumar (anticipatory bail rejected).[web:34][web:37][web:40]",
    "time": "27 September 2025 Karur rally; Madras HC orders October 2025; Supreme Court filings December 2025.[web:31][web:34][web:43]",
    "affiliation": "Tamilaga Vettri Kazhagam (TVK) party led by actor Vijay; all accused are party functionaries.[web:31][web:37]",
    "source": "[web:31][web:34][web:37][web:40][web:43]"
  },
  {
    "party_name": "TVK",
    "case_details": "Hit-and-Run Investigation from Karur Stampede: Separate criminal case ordered after campaign bus allegedly hit two bikes of TVK cadres during rally chaos and fled the scene; Madras HC directed seizure of CCTV footage and the bus itself for forensic examination.[web:34][web:37]",
    "who_did_it": "TVK campaign bus driver; rally organizers for inadequate crowd control.[web:34][web:37]",
    "time": "27 September 2025 during Karur rally; hit-and-run FIR directed October 2025.[web:34][web:37]",
    "affiliation": "TVK campaign vehicle and rally management team.[web:34]",
    "source": "[web:34][web:37][web:40]"
  },
  {
    "party_name": "TVK",
    "case_details": "Criminal Negligence Charges in Karur Stampede: Tamil Nadu government informed Supreme Court that deaths resulted from TVK's reckless actions, intentional delay by Vijay, and poor crowd coordination; court criticized TVK leaders for fleeing scene without assisting injured supporters.[web:31][web:43]",
    "who_did_it": "TVK chief Vijay and senior party leaders (fled scene per court); rally organizers.[web:31][web:40][web:43]",
    "time": "September-December 2025 legal proceedings following 27 September 2025 incident.[web:43]",
    "affiliation": "Tamilaga Vettri Kazhagam leadership and Karur district organizers.[web:43]",
    "source": "[web:31][web:40][web:43]"
  },
  {
    "leader_name": "M.K. Stalin",
    "party_name": "DMK",
    "case_name": "Chennai Metro Bribery Allegations (DMK Files)",
    "case_details": "BJP State President K. Annamalai released the 'DMK Files', alleging Stalin accepted a ₹200 crore bribe from an American firm in 2011 to secure a contract for the first phase of the Chennai Metro project during his tenure as Deputy Chief Minister.",
    "time": "Alleged bribe in 2011; Allegations released in April 2023.",
    "current_status": "DMK denied claims as politically motivated and issued legal notices."
  },
  {
    "leader_name": "Edappadi K. Palaniswami (EPS)",
    "party_name": "AIADMK",
    "case_name": "Highway Tender Scam",
    "case_details": "A complaint by the DMK alleged nepotism and corruption by EPS in awarding State Highways Department contracts to relatives. The Madras High Court initially ordered a CBI probe in 2018, but the Supreme Court later set aside the HC's order and remanded the case back for fresh consideration.",
    "time": "Allegations emerged in 2018.",
    "current_status": "Remanded back to the High Court by the Supreme Court."
  },
  {
    "leader_name": "Edappadi K. Palaniswami (EPS)",
    "party_name": "AIADMK",
    "case_name": "False Election Affidavit Inquiry",
    "case_details": "A complaint alleged that EPS knowingly furnished false information regarding his wealth, annual income, and education in his 2021 election affidavit. The Madras High Court dismissed his criminal revision petition in January 2025, allowing a police inquiry to proceed.",
    "time": "Affidavit filed in 2021; HC allowed probe in January 2025.",
    "current_status": "Police inquiry ongoing."
  },
  {
    "leader_name": "Edappadi K. Palaniswami (EPS)",
    "party_name": "AIADMK",
    "case_name": "Medical College Construction Graft Allegations",
    "case_details": "A probe was initiated by the state government over alleged massive irregularities and corruption in the construction of 11 new government medical colleges across the state during his tenure as Chief Minister. The DVAC later informed the Madras High Court that no prima facie case was found.",
    "time": "Probe sanctioned in 2023 for activities during 2020-2021.",
    "current_status": "DVAC reported no prima facie case found."
  },
  {
    "leader_name": "S. Seeman",
    "party_name": "NTK",
    "case_name": "Rape and Cheating Case",
    "case_details": "A prominent Tamil actor filed a severe FIR charging Seeman with rape, cheating, and criminal intimidation, alleging he sexually exploited her under a false promise of marriage. The Supreme Court quashed the FIR after a 14-year legal battle when Seeman tendered an unconditional apology and an out-of-court settlement was reached.",
    "time": "FIR filed in 2011; Quashed by Supreme Court in October 2025.[1]",
    "current_status": "Quashed following unconditional apology and settlement.[1]"
  },
  {
    "leader_name": "S. Seeman",
    "party_name": "NTK",
    "case_name": "Sedition and UAPA Charges (Inflammatory Speeches)",
    "case_details": "Seeman faced sedition charges for making inflammatory speeches in 2008 in Coimbatore and Rameswaram supporting the banned LTTE terrorist organization, and for a 2010 speech allegedly issuing threats against Sinhalese students in Tamil Nadu.",
    "time": "Speeches in 2008 and 2010.",
    "current_status": "Withdrew plea to quash the 2010 charge sheet in November 2024.[2]"
  },
  {
    "leader_name": "S. Seeman",
    "party_name": "NTK",
    "case_name": "SC/ST Act Violations and Defamation",
    "case_details": "Booked under the SC/ST Prevention of Atrocities Act for singing a song during the Vikravandi by-election campaign that utilized a specific caste name to allegedly defame the late DMK patriarch M. Karunanidhi.[3, 4]",
    "time": "August 2024.[4]",
    "current_status": "FIR Registered.[3]"
  },
  {
    "leader_name": "S. Seeman",
    "party_name": "NTK",
    "case_name": "Trichy Airport Clash",
    "case_details": "Charged alongside 18 others following a violent scuffle between NTK and MDMK cadres at the Trichy airport.[5]",
    "time": "Incident in 2018; Acquittal in July 2025.[5]",
    "current_status": "Acquitted by a judicial magistrate due to lack of substantial police evidence.[5]"
  },
  {
    "party_name": "DMK",
    "case_details": "Transport Department Cash-for-Jobs Scam: Arrested by the ED for an alleged money laundering scheme linked to bribes taken for government jobs. Bailed by Supreme Court after 471 days in custody.[2]",
    "who_did_it": "V. Senthil Balaji.[2]",
    "time": "Scam spanned 2011-2015; bailed in September 2024.[2]",
    "affiliation": "DMK Minister.[2]",
    "source": "[2]"
  },
  {
    "party_name": "DMK",
    "case_details": "International Drug Trafficking Cartel: Arrested by the NCB and ED for running a massive international cartel smuggling over ₹2,000 crore worth of pseudoephedrine to Australia and New Zealand.",
    "who_did_it": "Jaffer Sadiq and associates.",
    "time": "Arrested in March 2024.",
    "affiliation": "Former DMK NRI Wing Functionary.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Dinakaran Newspaper Attack: A violent mob firebombed the newspaper office over an opinion poll, killing three employees. Nine people were sentenced to life imprisonment.[3, 4]",
    "who_did_it": "V.P. Pandi (Attack Pandi), DSP Rajaram, and a mob of supporters.[3, 4]",
    "time": "Incident in May 2007; Madras HC life sentence in 2019.[3, 4]",
    "affiliation": "DMK functionaries and supporters of M.K. Alagiri.[3, 4]",
    "source": "[3, 4]"
  },
  {
    "party_name": "DMK",
    "case_details": "Systemic Land Grabbing: Numerous functionaries were arrested for land grabbing. Additionally, top leaders faced extortion and trespass charges for forcing a businessman to hand over prime property.[5, 6]",
    "who_did_it": "N.K.K.P. Raja, Veerapandi Arumugam, Udhayanidhi Stalin, M.K. Stalin.[5, 6]",
    "time": "2006-2011 (Arrests and bail proceedings in 2011).[5, 6]",
    "affiliation": "Senior DMK Leadership and Former Ministers.[5, 6]",
    "source": "[5, 6]"
  },
  {
    "party_name": "DMK",
    "case_details": "Disproportionate Assets Cases: Facing severe legal action for amassing illicit wealth, resulting in conviction and imprisonment for one, and a High Court-ordered fresh trial for another.[2, 7]",
    "who_did_it": "K. Ponmudy and I. Periyasamy.[2, 7]",
    "time": "Ponmudy convicted Dec 2023; Periyasamy trial reopened April 2024.[2, 7]",
    "affiliation": "Senior DMK Ministers.[2, 7]",
    "source": "[2, 7]"
  },
  {
    "party_name": "DMK",
    "case_details": "Arakkonam Sexual Assault Case: Accused by 20 women, including his wife, of systemic sexual assault, physical abuse, and coercing women to accommodate other political figures.",
    "who_did_it": "Deivaseyal.",
    "time": "Reported heavily during recent protests.",
    "affiliation": "DMK Youth Wing Leader (Arakkonam).",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Krishnagiri Sexual Assault: Arrested under the POCSO Act for the aggravated sexual assault of a 2.5-year-old girl, resulting in fatal internal injuries and her death.[8]",
    "who_did_it": "M. Periyanayagam alias Kalaignar.[8]",
    "time": "December 2025 / Arrested early 2026.[8]",
    "affiliation": "DMK Youth Wing Branch Secretary (Anchetty).[8]",
    "source": "[8]"
  },
  {
    "party_name": "DMK",
    "case_details": "Villupuram Sexual Assault and Extortion: Booked under BNS Section 64 for stripping a woman, sexually assaulting her, filming the act, and using it for blackmail.[9, 10]",
    "who_did_it": "Thiruvakkarai Bhaskaran.[9, 10]",
    "time": "Recent FIR under BNS.[9, 10]",
    "affiliation": "DMK Functionary.[9, 10]",
    "source": "[9, 10]"
  },
  {
    "party_name": "DMK",
    "case_details": "Perambalur Rape Case: Convicted and sentenced to 10 years of imprisonment in a severe rape case.",
    "who_did_it": "Rajkumar.",
    "time": "Sentenced in 2018.",
    "affiliation": "Former DMK MLA.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Personal Affair and Money Laundering Allegations: Accused of an affair and purchasing a ₹50 crore house in Dubai for actress Nivetha Pethuraj. The actress vehemently denied the claims as baseless.",
    "who_did_it": "Udhayanidhi Stalin.",
    "time": "Rumors circulated actively in 2024.",
    "affiliation": "DMK Deputy Chief Minister.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Red Giant Movies Monopoly: Accused of operating a monopoly in the Tamil cinema distribution network, strong-arming theatre owners, and using political clout to restrict rival films.",
    "who_did_it": "Udhayanidhi Stalin and Inban Udhayanidhi.",
    "time": "Founded in 2008, allegations ongoing.",
    "affiliation": "DMK First Family.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "PEN Organization Media Manipulation: Accused of using a PR agency to manipulate media narratives and spending ₹39 crore of public funds on a massive 'Pen Memorial' for M. Karunanidhi in the Bay of Bengal.",
    "who_did_it": "Populous Empowerment Network (PEN) and DMK Government.",
    "time": "2021-2024.",
    "affiliation": "DMK Government/PR Wing.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Suppression of Thuimai Paniyalargal (Sanitation Workers) Protests: Forceful police crackdown and detention of Greater Chennai Corporation conservancy workers protesting against privatization and demanding wage hikes.",
    "who_did_it": "DMK Government / State Police.",
    "time": "August-December 2025.",
    "affiliation": "DMK Government.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Exaggerated Investment Claims vs. Actual FDI: Accused of inflating industrial success, with opposition alleging only 8.8% of claimed ₹11.32 lakh crore MoUs materialized. Official FDI data showed Tamil Nadu at only 4-5% of the national share.",
    "who_did_it": "DMK Government.",
    "time": "2021-2024.",
    "affiliation": "DMK Government.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Mounting State Debt: Despite 'Dravidian Model' claims, Tamil Nadu's outstanding debt is officially projected to reach an astronomical ₹10.71 lakh crore by 2026-27.",
    "who_did_it": "DMK Government.",
    "time": "2021-2027 Projections.",
    "affiliation": "DMK Government.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Gutkha Bribery Scam: A massive scandal involving ₹39.91 crore paid to facilitate the illegal storage and sale of banned Gutkha. CBI charge-sheeted 17 people including two former DGPs.[11, 12]",
    "who_did_it": "C. Vijayabaskar, B.V. Ramana, T.K. Rajendran, S. George.[11, 12]",
    "time": "Uncovered in 2016; Governor sanctioned prosecution in 2023.[11, 12]",
    "affiliation": "AIADMK Former Ministers and State Police Chiefs.[11, 12]",
    "source": "[11, 12]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "LED Streetlight Tender Manipulation: Accused of manipulating rural streetlight tenders to award them to proxy companies, causing a ₹500 crore loss to the state exchequer.[13, 14]",
    "who_did_it": "S.P. Velumani and associates.[13, 14]",
    "time": "Scam spanned 2015-2018; DVAC raids in 2022.[13, 14]",
    "affiliation": "AIADMK Former Minister for Rural Development.[13, 14]",
    "source": "[13, 14]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Aavin Milk Cash-for-Jobs Scam: Booked by the CBI for allegedly taking millions in bribes (including ₹30 lakh from a single victim) in exchange for securing jobs in the state-run cooperative.",
    "who_did_it": "Rajenthra Bhalaji.",
    "time": "2020-2021.",
    "affiliation": "AIADMK Former Dairy Minister.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Kodanad Estate Heist and Murder: An 11-member armed gang broke into Jayalalithaa's retreat, murdering a security guard. Marked by suspicious subsequent deaths of prime accused; Sayan alleged involvement of top leadership.[15, 16]",
    "who_did_it": "Kanagaraj, Sayan, and gang (Allegations leveled against Edappadi K. Palaniswami and V.K. Sasikala).[15, 16]",
    "time": "April 2017.[15, 16]",
    "affiliation": "AIADMK Associates and Senior Leadership.[15, 16]",
    "source": "[15, 16]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Pollachi Sexual Assault Case: An organized syndicate gang-raped and blackmailed multiple women. Initial police handling faced heavy criticism, and an AIADMK forum secretary was arrested for threatening a victim's family.[17, 18]",
    "who_did_it": "Sabarirajan, Thirunavukkarasu, and others. AIADMK Amma Forum Sec K. Arulanantham.[17, 18]",
    "time": "Exposed in 2019; Nine sentenced to life imprisonment in 2025.[17, 18]",
    "affiliation": "AIADMK local functionaries and linked associates.[17, 18]",
    "source": "[17, 18]"
  },
  {
    "party_name": "AIADMK",
    "case_details": "Massive Disproportionate Assets Cases: Widespread DVAC raids uncovered massive wealth jumps, including one minister's assets allegedly increasing by 654%.",
    "who_did_it": "K.C. Veeramani, P. Thangamani, and other former ministers.",
    "time": "2016-2021 check periods; Raids in 2021-2022.",
    "affiliation": "AIADMK Former Ministers.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Thoothukudi Firing (Anti-Sterlite Protests): Police opened fire on civilians, killing 13 people. The Justice Aruna Jagadeesan Commission strongly indicted 17 police officials for excessive lethal force.",
    "who_did_it": "Tamil Nadu Police under AIADMK Administration.",
    "time": "May 2018.",
    "affiliation": "AIADMK Government.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Medical College Construction Graft: DVAC initiated a probe into massive irregularities and corruption in the construction of 11 new government medical colleges.",
    "who_did_it": "Edappadi K. Palaniswami (probe initiated, later reported no prima facie case found by DVAC).",
    "time": "2020-2021.",
    "affiliation": "Former AIADMK Chief Minister.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Real Estate Bribery & Money Laundering: ED raided and attached ₹100 crore in properties belonging to a former minister accused of taking a ₹27.9 crore bribe from Shriram Properties for planning permissions.",
    "who_did_it": "R. Vaithilingam.",
    "time": "Bribe in 2016; ED raids in 2024.",
    "affiliation": "AIADMK Former Minister / Current MLA.",
    "source": ""
  },
  {
    "party_name": "AIADMK / DMK (Mixed Controversy)",
    "case_details": "Kidney Trafficking Scam: An illegal organ trade racket in Namakkal lured impoverished workers to sell kidneys for ₹5-10 lakh, but paid a fraction. AIADMK attacked DMK because one implicated hospital was linked to a DMK MLA's father.",
    "who_did_it": "Brokers and Private Hospitals (Dhanalakshmi Srinivasan Medical College linked to DMK MLA Kathiravan).",
    "time": "Exposed in 2025.",
    "affiliation": "Brokers / Hospitals linked to DMK functionaries; protested by AIADMK.",
    "source": ""
  },
  {
    "party_name": "Multiple / General State Failure",
    "case_details": "Human Trafficking (Cambodia): Local agents lured unemployed youth with fake data entry jobs, trafficking them to Cambodia to commit cybercrimes. AIADMK highlighted this as a state failure.",
    "who_did_it": "International Syndicates / Local Agents.",
    "time": "Ongoing / 2024.",
    "affiliation": "State Governance failure.",
    "source": ""
  },
  {
    "party_name": "BJP",
    "case_details": "Aarudhra Gold Trading Scam: A massive Ponzi scheme defrauding 1.92 lakh investors of ₹2,438 crore. Multiple BJP functionaries were implicated and arrested for receiving massive fraudulent funds.",
    "who_did_it": "K. Harish, R.K. Suresh, and other directors/middlemen.",
    "time": "2020-2022; Arrests in 2023.",
    "affiliation": "BJP Sports and Skill Development Cell / OBC Wing Functionaries.",
    "source": ""
  },
  {
    "party_name": "BJP",
    "case_details": "Investment Fraud (Mylapore Niti): Arrested by the Economic Offences Wing for defrauding over 140 depositors of ₹50 crore by promising 10-11% interest returns.",
    "who_did_it": "T. Dhevanathan Yadav.",
    "time": "Arrested August 2024.",
    "affiliation": "BJP Parliamentary Candidate (Sivaganga) / Ally.",
    "source": ""
  },
  {
    "party_name": "BJP",
    "case_details": "Extortion by Functionaries: Arrested for extorting ₹10 lakh from a grieving family's insurance payout, and demanding an additional ₹10 lakh as a mandatory 'party fund'.[19, 20]",
    "who_did_it": "C. Saminathan, Gokulakannan, Rasukutty.[19, 20]",
    "time": "October 2025.[19, 20]",
    "affiliation": "BJP Coimbatore North District Secretary.[19, 20]",
    "source": "[19, 20]"
  },
  {
    "party_name": "BJP",
    "case_details": "Sanctuary for History-Sheeters: Arrested for cheating consumer durable suppliers. Police revealed the accused had over 50 pending criminal cases including attempt to murder and red sandalwood smuggling.[21]",
    "who_did_it": "K.R. Venkatesan alias 'Milagaipodi' Venkatesan.[21]",
    "time": "Arrested June 2025.[21]",
    "affiliation": "BJP OBC Morcha Functionary.[21]",
    "source": "[21]"
  },
  {
    "party_name": "BJP",
    "case_details": "Cheating for Party Tickets: Booked for swindling a businessman out of ₹50 lakh under the false promise of securing him an election ticket from Tiruvannamalai.",
    "who_did_it": "Vijayaraman, Ragothaman, Narothaman.",
    "time": "Registered in July 2021.",
    "affiliation": "BJP Functionaries.",
    "source": ""
  },
  {
    "party_name": "NTK",
    "case_details": "Sedition and UAPA Charges: Faced extensive charges for making inflammatory public speeches supporting the banned LTTE terrorist organization and issuing violent threats against Sinhalese students.[22, 23]",
    "who_did_it": "S. Seeman.[22, 23]",
    "time": "Speeches in 2008 & 2010; legal battles through 2024.[22, 23]",
    "affiliation": "NTK Chief Coordinator.[22, 23]",
    "source": "[22, 23]"
  },
  {
    "party_name": "NTK",
    "case_details": "SC/ST Act Violations and Defamation: Booked under the SC/ST Prevention of Atrocities Act for singing a song utilizing a specific caste name to allegedly defame late CM M. Karunanidhi.",
    "who_did_it": "S. Seeman and 'Saattai' Durai Murugan.",
    "time": "August 2024.",
    "affiliation": "NTK Chief Coordinator and Functionaries.",
    "source": ""
  },
  {
    "party_name": "NTK",
    "case_details": "Rape and Cheating Allegations: A severe FIR filed by an actor detailing rape, cheating, and criminal intimidation based on a false promise of marriage. Quashed following an unconditional apology and settlement.[24]",
    "who_did_it": "S. Seeman.[24]",
    "time": "FIR in 2011; Quashed by Supreme Court in Oct 2025.[24]",
    "affiliation": "NTK Chief Coordinator.[24]",
    "source": "[24]"
  },
  {
    "party_name": "NTK",
    "case_details": "Financial Fraud: Arrested by the city crime branch for allegedly cheating eight people out of ₹1.8 crore and misappropriating 65 sovereigns of gold via a pawn broker shop.",
    "who_did_it": "Dharmaraj.",
    "time": "Arrested in 2020.",
    "affiliation": "NTK Functionary (Coimbatore).",
    "source": ""
  },
  {
    "party_name": "TVK",
    "case_details": "Karur Stampede Mass Casualty: A catastrophic crowd crush due to severe administrative mismanagement, delayed schedules, and safety violations resulted in 41 deaths and over 100 injuries. CBI probe ordered by Supreme Court.",
    "who_did_it": "TVK Leadership (Vijay, N. Anand, C.T.R. Nirmal Kumar).",
    "time": "September 27, 2025.",
    "affiliation": "TVK Party Chief and General Secretaries.",
    "source": ""
  },
  {
    "party_name": "TVK",
    "case_details": "Adultery and Divorce Scandal: Wife of 27 years filed for divorce, accusing the party chief of an adulterous relationship with an actress, severe mental torture, and imposing financial restrictions restricting her free movement.[25, 26, 27]",
    "who_did_it": "Vijay (accused by wife Sangeetha Sornalingam).[25, 26, 27]",
    "time": "Petition filed February 24, 2026.[25, 26, 27]",
    "affiliation": "TVK Party Chief.[25, 26, 27]",
    "source": "[25, 26, 27]"
  },
  {
    "party_name": "DMK",
    "case_details": "Ramapuram Land Grab: An anti-corruption NGO exposed a scandal where 2.6 acres of government revenue land worth over ₹100 crore was allegedly encroached upon using a Hindu temple as a cover.",
    "who_did_it": "DMK Councillors Selvakumar and Raji (alongside a PMK functionary).",
    "time": "Exposed in June 2025.",
    "affiliation": "DMK Local Councillors.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "St. Thomas Mount Land Grab and Violence: A Chennai resident was brutally attacked by associates of party functionaries over a land grabbing dispute. This followed allegations that a state minister's family illegally seized over ₹400 crore worth of government land.",
    "who_did_it": "Associates of DMK functionaries and a DMK Minister's family.",
    "time": "Late 2025.",
    "affiliation": "DMK Functionaries and Ministerial Family.",
    "source": ""
  },
  {
    "party_name": "DMK",
    "case_details": "Cheating and Fraud: Arrested by the Chennai Police on charges of cheating and financial fraud.",
    "who_did_it": "M. Sathish.",
    "time": "November 2022.",
    "affiliation": "Former DMK IT wing organiser for Ward 176.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Massive Disproportionate Assets (₹58.44 Crore): The DVAC filed a charge sheet accusing the leader of amassing wealth entirely disproportionate to his known sources of income during his tenure as a minister.",
    "who_did_it": "R. Kamaraj and his sons Dr. M.K. Eniyan and Dr. K. Inban.",
    "time": "Check period 2015-2021; Charge sheet filed in 2023.",
    "affiliation": "Former AIADMK Minister for Food and Civil Supplies.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Highway Tender Irregularities: A fresh DVAC FIR was registered regarding substandard work and tender manipulation in road and bridge projects, causing an estimated ₹20 crore loss to the exchequer. Fake work experience documents were allegedly used to win tenders.",
    "who_did_it": "S. Jagadeesan (retired executive engineer) and contractors including KCP Engineers (allegedly close to AIADMK MLA S.P. Velumani).",
    "time": "Tenders awarded 2016-2021; FIR registered in October 2025.",
    "affiliation": "AIADMK-linked Contractors and Former Officials.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Real Estate Bribery and Money Laundering: The Enforcement Directorate attached ₹100 crore in properties after the DVAC booked the leader for allegedly receiving a ₹27.9 crore bribe from Shriram Properties to grant CMDA planning permissions. The bribe was allegedly routed through shell companies as an unsecured loan.",
    "who_did_it": "R. Vaithilingam and his sons.",
    "time": "Bribe paid in 2014-2016; DVAC FIR and ED Raids in 2024-2025.",
    "affiliation": "Former AIADMK Housing Minister and Current MLA.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Disproportionate Assets (654% Income Jump): DVAC raided 35 premises and found the minister had amassed ₹28.78 crore, representing a 654% jump over his declared income. Seizures included nine luxury cars (including a Rolls Royce), 5 kg of gold jewellery, and ₹34 lakh in cash.",
    "who_did_it": "K.C. Veeramani.",
    "time": "Check period 2016-2021; Raids in September 2021.",
    "affiliation": "Former AIADMK Minister for Commercial Taxes.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Disproportionate Assets and Shell Companies: DVAC searched 69 premises across Tamil Nadu, Andhra Pradesh, and Karnataka. The leader was booked for amassing ₹4.85 crore in illicit wealth, allegedly funneling money through fictitious firms operated by his son.",
    "who_did_it": "P. Thangamani, his son T. Dharanidharan, and wife T. Santhi.",
    "time": "Check period 2016-2020; Raids in December 2021.",
    "affiliation": "Former AIADMK Minister for Electricity.",
    "source": ""
  },
  {
    "party_name": "AIADMK",
    "case_details": "Aavin Cash-for-Jobs Scam: The CBI registered a cheating case following a Madras High Court directive. The accused allegedly collected ₹30 lakh from a single victim (and up to ₹1.6 crore overall) under the false promise of securing jobs in the state-run Aavin milk cooperative.",
    "who_did_it": "K.T. Rajenthra Bhalaji, V. Nallathambi, and Mariyappan.",
    "time": "Scam occurred between Nov 2020 and Feb 2021; CBI case filed in 2024/2025.",
    "affiliation": "Former AIADMK Minister for Milk and Dairy Development.",
    "source": ""
  }
]